part of 'terms_imports.dart';

class TermsController {
  final BaseBloc<String?> termsCubit = BaseBloc('');
  String name = "mohamed";
  String terms = """
  1.الشروط والاحكام
  
  يُرجى قراءة هذه الشروط والأحكام بعناية قبل استخدام تطبيق الجوال الخاص بنا. باستخدامك للتطبيق، فإنك توافق على الالتزام بهذه الشروط.

يُرجى قراءة هذه الشروط والأحكام بعناية قبل استخدام تطبيق الجوال الخاص بنا. باستخدامك للتطبيق

يُرجى قراءة هذه الشروط والأحكام بعناية قبل استخدام تطبيق الجوال الخاص بنا.


  1.الشروط والاحكام
  
  يُرجى قراءة هذه الشروط والأحكام بعناية قبل استخدام تطبيق الجوال الخاص بنا. باستخدامك للتطبيق، فإنك توافق على الالتزام بهذه الشروط.

يُرجى قراءة هذه الشروط والأحكام بعناية قبل استخدام تطبيق الجوال الخاص بنا. باستخدامك للتطبيق

يُرجى قراءة هذه الشروط والأحكام بعناية قبل استخدام تطبيق الجوال الخاص بنا.


  1.الشروط والاحكام
  
  يُرجى قراءة هذه الشروط والأحكام بعناية قبل استخدام تطبيق الجوال الخاص بنا. باستخدامك للتطبيق، فإنك توافق على الالتزام بهذه الشروط.

يُرجى قراءة هذه الشروط والأحكام بعناية قبل استخدام تطبيق الجوال الخاص بنا. باستخدامك للتطبيق

يُرجى قراءة هذه الشروط والأحكام بعناية قبل استخدام تطبيق الجوال الخاص بنا.
""";
  getTermsData() async {
    termsCubit.loadingState();
    ///////////use case
    await Future.delayed(Duration(seconds: 2));
    termsCubit.successState(terms);
  }
}
